Pandas library (External library)

In [1]:
# Pandas is used for working on data
# Series (list, Single dimension Array)
# Dataframe (2D Data, Tabular format)

In [2]:
# Importing libraries
import pandas as pd

In [10]:
# Creating dummy data
data={
    'Stu_ID':[101,102,103,104,105,106,107],
    'Stu_Name':['Priya','Riya','Khushi','Akansha','Siya','Yashi','Ruhi'],
    'Stu %':[98,78,67,69,80,87,85]

}

In [11]:
# Creating a Dataframe (2D dataset)
df=pd.DataFrame(data)

In [12]:
df

   Stu_ID Stu_Name  Stu %
0     101    Priya     98
1     102     Riya     78
2     103   Khushi     67
3     104  Akansha     69
4     105     Siya     80
5     106    Yashi     87
6     107     Ruhi     85

In [13]:
# By deafault, head will print first 5 rows
df.head()

   Stu_ID Stu_Name  Stu %
0     101    Priya     98
1     102     Riya     78
2     103   Khushi     67
3     104  Akansha     69
4     105     Siya     80

In [14]:
df.head(3)

   Stu_ID Stu_Name  Stu %
0     101    Priya     98
1     102     Riya     78
2     103   Khushi     67

In [15]:
# By deafault, tail will print last 5 rows
df.tail()

   Stu_ID Stu_Name  Stu %
2     103   Khushi     67
3     104  Akansha     69
4     105     Siya     80
5     106    Yashi     87
6     107     Ruhi     85

In [16]:
# Printing column names
df.columns

Index(['Stu_ID', 'Stu_Name', 'Stu %'], dtype='object')

In [17]:
df.Stu_ID

0    101
1    102
2    103
3    104
4    105
5    106
6    107
Name: Stu_ID, dtype: int64

In [18]:
df.Stu_Name

0      Priya
1       Riya
2     Khushi
3    Akansha
4       Siya
5      Yashi
6       Ruhi
Name: Stu_Name, dtype: object

In [19]:
# Calculating average of a column
print("Average Marks:",df["Stu %"].sum()/len(df))

Average Marks: 80.57142857142857

In [20]:
# Counting number of rows in a dataframe
len(df)

7

In [34]:
# Creating a Dummy Dataset
data={
    'Emp_ID':[*range(101,111)],
    'Emp_Name':['Ansh','Ayush','Sneha','Parv','Dev','Daksh','Nishi','Vanshi','Ajay','Aryan'],
    'Emp_Salary':[35900,25680,30768,43678,24657,25777,34678,34575,25578,31457],
    'Emp_Add':['Noida','Gurgaon','Ghaziabad','Delhi','Pune','Delhi','Bangalore','Gujrat','Noida','Haryana']
}

In [35]:
import pandas as pd

In [36]:
df = pd.DataFrame(data)

In [37]:
df

   Emp_ID Emp_Name  Emp_Salary    Emp_Add
0     101     Ansh       35900      Noida
1     102    Ayush       25680    Gurgaon
2     103    Sneha       30768  Ghaziabad
3     104     Parv       43678      Delhi
4     105      Dev       24657       Pune
5     106    Daksh       25777      Delhi
6     107    Nishi       34678  Bangalore
7     108   Vanshi       34575     Gujrat
8     109     Ajay       25578      Noida
9     110    Aryan       31457    Haryana

In [38]:
df.head()

   Emp_ID Emp_Name  Emp_Salary    Emp_Add
0     101     Ansh       35900      Noida
1     102    Ayush       25680    Gurgaon
2     103    Sneha       30768  Ghaziabad
3     104     Parv       43678      Delhi
4     105      Dev       24657       Pune

In [39]:
df.head(7)

   Emp_ID Emp_Name  Emp_Salary    Emp_Add
0     101     Ansh       35900      Noida
1     102    Ayush       25680    Gurgaon
2     103    Sneha       30768  Ghaziabad
3     104     Parv       43678      Delhi
4     105      Dev       24657       Pune
5     106    Daksh       25777      Delhi
6     107    Nishi       34678  Bangalore

In [40]:
df.tail()

   Emp_ID Emp_Name  Emp_Salary    Emp_Add
5     106    Daksh       25777      Delhi
6     107    Nishi       34678  Bangalore
7     108   Vanshi       34575     Gujrat
8     109     Ajay       25578      Noida
9     110    Aryan       31457    Haryana

In [41]:
df.columns

Index(['Emp_ID', 'Emp_Name', 'Emp_Salary', 'Emp_Add'], dtype='object')

In [42]:
for col in df.columns:
    print(col)

Emp_ID
Emp_Name
Emp_Salary
Emp_Add

In [43]:
df.Emp_ID

0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
8    109
9    110
Name: Emp_ID, dtype: int64

In [44]:
print("Total Salary:",df.Emp_Salary.sum())

Total Salary: 312748

In [45]:
# Most repeating value
df.Emp_Add.mode()

0    Delhi
1    Noida
Name: Emp_Add, dtype: object

In [48]:
# mean=Average
print("Average Salary:",df.Emp_Salary.mean())

Average Salary: 31274.8

In [49]:
# meadian=Middle value
print("Middle salary:",df.Emp_Salary.median())

Middle salary: 31112.5

In [50]:
sorted(df.Emp_Salary)

[24657, 25578, 25680, 25777, 30768, 31457, 34575, 34678, 35900, 43678]

In [51]:
# This will be the median value if no. of value are in even
(30768+31457)/2

31112.5

In [52]:
# Standard deviation (std)
df.Emp_Salary.std()

np.float64(6108.021843808717)

In [54]:
import numpy as np

In [55]:
# Creating a Dummy Dataset
data={
    'Emp_ID':[*range(101,111)],
    'Emp_Name':['Ansh','Ayush','Sneha','Parv',np.nan,'Daksh','Nishi','Vanshi','Ajay','Aryan'],
    'Emp_Salary':[35900,25680,30768,np.nan,24657,25777,34678,34575,25578,31457],
    'Emp_Add':['Noida','Gurgaon','Ghaziabad','Delhi','Pune',np.nan,'Bangalore','Gujrat','Noida','Haryana']
}

In [56]:
df=pd.DataFrame(data)

In [57]:
df

   Emp_ID Emp_Name  Emp_Salary    Emp_Add
0     101     Ansh     35900.0      Noida
1     102    Ayush     25680.0    Gurgaon
2     103    Sneha     30768.0  Ghaziabad
3     104     Parv         NaN      Delhi
4     105      NaN     24657.0       Pune
5     106    Daksh     25777.0        NaN
6     107    Nishi     34678.0  Bangalore
7     108   Vanshi     34575.0     Gujrat
8     109     Ajay     25578.0      Noida
9     110    Aryan     31457.0    Haryana

In [58]:
# Finding Null values in dataset
df.isnull()

   Emp_ID  Emp_Name  Emp_Salary  Emp_Add
0   False     False       False    False
1   False     False       False    False
2   False     False       False    False
3   False     False        True    False
4   False      True       False    False
5   False     False       False     True
6   False     False       False    False
7   False     False       False    False
8   False     False       False    False
9   False     False       False    False

In [60]:
# Total null values by column
df.isnull().sum()

Emp_ID        0
Emp_Name      1
Emp_Salary    1
Emp_Add       1
dtype: int64

In [61]:
# Total null values in a dataset
df.isnull().sum().sum()

np.int64(3)

In [63]:
# Shape of the dataset (rows,columns)
print("Shape:",df.shape)
print("Total Rows:",df.shape[0])
print("Total Data Points:",df.shape[0]*df.shape[1])

Shape: (10, 4)
Total Rows: 10
Total Data Points: 40

In [67]:
# Missing %age of data in dataset
print("Missing Data %age:",df.isnull().sum().sum()/(df.shape[1]*df.shape[0])*100,"%")

Missing Data %age: 7.5 %

In [1]:
import pandas as pd

In [2]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\hp\appdata\local\programs\python\python314\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\hp\appdata\local\programs\python\python314\lib\site-packages (from openpyxl) (2.0.0)

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
df=pd.read_excel("C:/Users/hp/Downloads/Financial_Sample.xlsx")

In [4]:
df.head(4)

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,NaN,1618.5,3,20.0,32370.0,0.0,32370.0,16185.0,16185.0,2014-01-01,1,January,2014
1,Government,Germany,Carretera,NaN,1321.0,3,20.0,26420.0,0.0,26420.0,13210.0,13210.0,2014-01-01,1,January,2014
2,Midmarket,France,Carretera,NaN,2178.0,3,15.0,32670.0,0.0,32670.0,21780.0,10890.0,2014-06-01,6,June,2014
3,Midmarket,Germany,Carretera,NaN,888.0,3,15.0,13320.0,0.0,13320.0,8880.0,4440.0,2014-06-01,6,June,2014

In [6]:
print(df.columns)
print("Total no. of columns:",len(df.columns))

Index(['Segment', 'Country', 'Product', 'Discount Band', 'Units Sold',
       'Manufacturing Price', 'Sale Price', 'Gross Sales', 'Discounts',
       ' Sales', 'COGS', 'Profit', 'Date', 'Month Number', 'Month Name',
       'Year'],
      dtype='object')
Total no. of columns: 16

In [8]:
# Find missing values in your dataset
df.isnull().sum()

Segment                 8
Country                11
Product                 8
Discount Band          62
Units Sold              5
Manufacturing Price     0
Sale Price              7
Gross Sales             5
Discounts               5
 Sales                  0
COGS                    0
Profit                  0
Date                    0
Month Number            0
Month Name              0
Year                    0
dtype: int64

In [10]:
# Information about dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 16 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Segment              692 non-null    object
 1   Country              689 non-null    object
 2   Product              692 non-null    object
 3   Discount Band        638 non-null    object
 4   Units Sold           695 non-null    float64
 5   Manufacturing Price  700 non-null    int64
 6   Sale Price           693 non-null    float64
 7   Gross Sales          695 non-null    float64
 8   Discounts            695 non-null    float64
 9    Sales               700 non-null    float64
 10  COGS                 700 non-null    float64
 11  Profit               700 non-null    float64
 12  Date                 700 non-null    datetime64[ns]
 13  Month Number         700 non-null    int64
 14  Month Name           700 non-null    object
 15  Year                 700 non-null    int64
dtypes: datetime64[ns](1), float64(7), int64(3), object(5)
memory usage: 87.6+ KB

##### Categorical Data (tring/object)
    -Nominal Data
        City, State, Country, Segment, Gender etc
    -Ordinal Data
        - Band Data (low, medium, high etc)
        - Size data (small, medium, large, extra large etc)
    if you need to clean categorical data (replace data by modeor unknown/new)
##### Numerical Data
    -int (45, -78, 0, 645)
    -float (56.09, -63.8, 0.0, 0.758, -0.87)
    if you need to clean numerical data (replace null by average)

In [15]:
# Finding missing values columns and their data types
# EDA (Exploratory Data Analysis)
print("Column_name\tNull\t Dtype")
for col in df.columns:
    if df[col].isnull().sum()  > 0:
        print(col,"\t",df[col].isnull().sum(),"\t",df[col].dtype)

Column_name	Null	 Dtype
Segment 	 8 	 object
Country 	 11 	 object
Product 	 8 	 object
Discount Band 	 62 	 object
Units Sold 	 5 	 float64
Sale Price 	 7 	 float64
Gross Sales 	 5 	 float64
Discounts 	 5 	 float64

In [16]:
df.Segment.isnull().sum()

np.int64(8)

In [17]:
df.Segment.unique()

array(['Government', 'Midmarket', 'Channel Partners', 'Enterprise',
       'Small Business', nan], dtype=object)

In [18]:
df.Segment.mode()

0    Government
Name: Segment, dtype: object

In [21]:
df.Segment=df.Segment.fillna(value='Unknown_Segment')

In [22]:
df.head(50)

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,NaN,1618.5,3,20.0,32370.0,0.0,32370.0,16185.0,16185.0,2014-01-01,1,January,2014
1,Government,Germany,Carretera,NaN,1321.0,3,20.0,26420.0,0.0,26420.0,13210.0,13210.0,2014-01-01,1,January,2014
2,Midmarket,France,Carretera,NaN,2178.0,3,15.0,32670.0,0.0,32670.0,21780.0,10890.0,2014-06-01,6,June,2014
3,Midmarket,Germany,Carretera,NaN,888.0,3,15.0,13320.0,0.0,13320.0,8880.0,4440.0,2014-06-01,6,June,2014
4,Midmarket,Mexico,Carretera,NaN,2470.0,3,15.0,37050.0,0.0,37050.0,24700.0,12350.0,2014-06-01,6,June,2014
5,Government,Germany,Carretera,NaN,1513.0,3,350.0,529550.0,0.0,529550.0,393380.0,136170.0,2014-12-01,12,December,2014
6,Midmarket,Germany,Montana,NaN,921.0,5,15.0,13815.0,0.0,13815.0,9210.0,4605.0,2014-03-01,3,March,2014
7,Channel Partners,Canada,Montana,NaN,2518.0,5,12.0,30216.0,0.0,30216.0,7554.0,22662.0,2014-06-01,6,June,2014
8,Government,France,Montana,NaN,1899.0,5,20.0,37980.0,0.0,37980.0,18990.0,18990.0,2014-06-01,6,June,2014
9,Channel Partners,Germany,Montana,NaN,1545.0,5,12.0,18540.0,0.0,18540.0,4635.0,13905.0,2014-06-01,6,June,2014
10,Midmarket,Mexico,Montana,NaN,2470.0,5,15.0,37050.0,0.0,37050.0,24700.0,12350.0,2014-06-01,6,June,2014
11,Enterprise,Canada,Montana,NaN,2665.5,5,125.0,333187.5,0.0,333187.5,319860.0,13327.5,2014-07-01,7,July,2014
12,Small Business,Mexico,Montana,NaN,958.0,5,300.0,287400.0,0.0,287400.0,239500.0,47900.0,2014-08-01,8,August,2014
13,Government,Germany,Montana,NaN,2146.0,5,7.0,15022.0,0.0,15022.0,10730.0,4292.0,2014-09-01,9,September,2014
14,Enterprise,Canada,Montana,NaN,345.0,5,125.0,43125.0,0.0,43125.0,41400.0,1725.0,2013-10-01,10,October,2013
15,Midmarket,United States of America,Montana,NaN,615.0,5,15.0,9225.0,0.0,9225.0,6150.0,3075.0,2014-12-01,12,December,2014
16,Government,Canada,Paseo,NaN,292.0,10,20.0,5840.0,0.0,5840.0,2920.0,2920.0,2014-02-01,2,February,2014
17,Midmarket,Mexico,Paseo,NaN,974.0,10,15.0,14610.0,0.0,14610.0,9740.0,4870.0,2014-02-01,2,February,2014
18,Channel Partners,Canada,Paseo,NaN,2518.0,10,12.0,30216.0,0.0,30216.0,7554.0,22662.0,2014-06-01,6,June,2014
19,Government,Germany,Paseo,NaN,1006.0,10,350.0,352100.0,0.0,352100.0,261560.0,90540.0,2014-06-01,6,June,2014
20,Channel Partners,Germany,Paseo,NaN,367.0,10,12.0,4404.0,0.0,4404.0,1101.0,3303.0,2014-07-01,7,July,2014
21,Government,Mexico,Paseo,NaN,883.0,10,7.0,6181.0,0.0,6181.0,4415.0,1766.0,2014-08-01,8,August,2014
22,Midmarket,France,Paseo,NaN,549.0,10,15.0,8235.0,0.0,8235.0,5490.0,2745.0,2013-09-01,9,September,2013
23,Small Business,Mexico,Paseo,NaN,788.0,10,300.0,236400.0,0.0,236400.0,197000.0,39400.0,2013-09-01,9,September,2013
24,Midmarket,Mexico,Paseo,NaN,2472.0,10,15.0,37080.0,0.0,37080.0,24720.0,12360.0,2014-09-01,9,September,2014
25,Government,United States of America,Paseo,NaN,1143.0,10,7.0,8001.0,0.0,8001.0,5715.0,2286.0,2014-10-01,10,October,2014
26,Government,Canada,Paseo,NaN,1725.0,10,350.0,603750.0,0.0,603750.0,448500.0,155250.0,2013-11-01,11,November,2013
27,Channel Partners,United States of America,Paseo,NaN,912.0,10,12.0,10944.0,0.0,10944.0,2736.0,8208.0,2013-11-01,11,November,2013
28,Midmarket,Canada,Paseo,NaN,2152.0,10,15.0,32280.0,0.0,32280.0,21520.0,10760.0,2013-12-01,12,December,2013
29,Government,Canada,Paseo,NaN,1817.0,10,20.0,36340.0,0.0,36340.0,18170.0,18170.0,2014-12-01,12,December,2014
30,Unknown_Segment,Germany,Paseo,NaN,1513.0,10,350.0,529550.0,0.0,529550.0,393380.0,136170.0,2014-12-01,12,December,2014
31,Unknown_Segment,Mexico,Velo,NaN,1493.0,120,7.0,10451.0,0.0,10451.0,7465.0,2986.0,2014-01-01,1,January,2014
32,Enterprise,France,Velo,NaN,1804.0,120,125.0,225500.0,0.0,225500.0,216480.0,9020.0,2014-02-01,2,February,2014
33,Channel Partners,Germany,Velo,NaN,2161.0,120,12.0,25932.0,0.0,25932.0,6483.0,19449.0,2014-03-01,3,March,2014
34,Government,Germany,Velo,NaN,1006.0,120,350.0,352100.0,0.0,352100.0,261560.0,90540.0,2014-06-01,6,June,2014
35,Channel Partners,Germany,Velo,NaN,1545.0,120,12.0,18540.0,0.0,18540.0,4635.0,13905.0,2014-06-01,6,June,2014
36,Enterprise,United States of America,Velo,NaN,2821.0,120,125.0,352625.0,0.0,352625.0,338520.0,14105.0,2014-08-01,8,August,2014
37,Enterprise,Canada,Velo,NaN,345.0,120,125.0,43125.0,0.0,43125.0,41400.0,1725.0,2013-10-01,10,October,2013
38,Small Business,Canada,VTT,NaN,2001.0,250,300.0,600300.0,0.0,600300.0,500250.0,100050.0,2014-02-01,2,February,2014
39,Channel Partners,Germany,VTT,NaN,2838.0,250,12.0,34056.0,0.0,34056.0,8514.0,25542.0,2014-04-01,4,April,2014
40,Midmarket,France,VTT,NaN,2178.0,250,15.0,32670.0,0.0,32670.0,21780.0,10890.0,2014-06-01,6,June,2014
41,Midmarket,Germany,VTT,NaN,888.0,250,15.0,13320.0,0.0,13320.0,8880.0,4440.0,2014-06-01,6,June,2014
42,Government,France,VTT,NaN,1527.0,250,350.0,534450.0,0.0,534450.0,397020.0,137430.0,2013-09-01,9,September,2013
43,Small Business,France,VTT,NaN,2151.0,250,300.0,645300.0,0.0,645300.0,537750.0,107550.0,2014-09-01,9,September,2014
44,Government,Canada,VTT,NaN,1817.0,250,20.0,36340.0,0.0,36340.0,18170.0,18170.0,2014-12-01,12,December,2014
45,Government,France,Amarilla,NaN,2750.0,260,350.0,962500.0,0.0,962500.0,715000.0,247500.0,2014-02-01,2,February,2014
46,Channel Partners,United States of America,Amarilla,NaN,1953.0,260,12.0,23436.0,0.0,23436.0,5859.0,17577.0,2014-04-01,4,April,2014
47,Enterprise,Germany,Amarilla,NaN,4219.5,260,125.0,527437.5,0.0,527437.5,506340.0,21097.5,2014-04-01,4,April,2014
48,Government,France,Amarilla,NaN,1899.0,260,20.0,37980.0,0.0,37980.0,18990.0,18990.0,2014-06-01,6,June,2014
49,Government,Germany,Amarilla,NaN,1686.0,260,7.0,11802.0,0.0,11802.0,8430.0,3372.0,2014-07-01,7,July,2014

In [23]:
df.Segment.isnull().sum()

np.int64(0)